Repository: Schwaggot/etcetera
Catalog: Sources/EtcdSchema/Localizable.xcstrings
Source language: en
Languages: de

# %@ has number %lld, outside 1 to 536870911
source: %1$@ has number %2$lld, outside 1 to 536870911
de: %1$@ hat die Nummer %2$lld, außerhalb von 1 bis 536870911

source: %@ is not a duration like "1.5s"
de: %@ ist keine Dauer wie "1.5s"

source: %@ is not a number
de: %@ ist keine Zahl

# %@ is not a value of %@
source: %1$@ is not a value of %2$@
de: %1$@ ist kein Wert von %2$@

source: %@ is not a value of the enum
de: %@ ist kein Wert der Aufzählung

source: %@ is not an RFC 3339 timestamp
de: %@ ist kein RFC-3339-Zeitstempel

source: %@ is not an integer
de: %@ ist keine Ganzzahl

source: %@ is not an unsigned integer
de: %@ ist keine vorzeichenlose Ganzzahl

source: %@ is not in the schema, so Any needs its raw "value" as base64
de: %@ ist nicht im Schema, daher braucht Any seinen rohen "value" als Base64

source: %@ is out of range
de: %@ liegt außerhalb des Wertebereichs

source: %@ is out of range for float
de: %@ liegt außerhalb des Wertebereichs für float

# %@ names oneof %lld, which is not declared
source: %1$@ names oneof %2$lld, which is not declared
de: %1$@ nennt oneof %2$lld, das nicht deklariert ist

source: Any needs an "@type" string
de: Any braucht einen "@type"-String

source: Any of %@ needs exactly a "value" field
de: Any mit %@ braucht genau ein "value"-Feld

source: Duration is out of range or has mixed signs
de: Duration liegt außerhalb des Wertebereichs oder hat gemischte Vorzeichen

# Field %@ refers to %@, which is not in the schema.
source: Field %1$@ refers to %2$@, which is not in the schema.
de: Feld %1$@ verweist auf %2$@, das nicht im Schema ist.

# JSON syntax error at line %lld, column %lld: %@
source: JSON syntax error at line %1$lld, column %2$lld: %3$@
de: JSON-Syntaxfehler in Zeile %1$lld, Spalte %2$lld: %3$@

source: The compiled schema could not be read: %@
de: Das kompilierte Schema konnte nicht gelesen werden: %@

source: The message type %@ is not in the schema.
de: Der Nachrichtentyp %@ ist nicht im Schema.

source: The schema has not been compiled.
de: Das Schema wurde noch nicht kompiliert.

# The value is not a valid %@ at %@: %@
source: The value is not a valid %1$@ at %2$@: %3$@
de: Der Wert ist bei %2$@ kein gültiges %1$@: %3$@

# The value is not a valid %@: %@
source: The value is not a valid %1$@: %2$@
de: Der Wert ist kein gültiges %1$@: %2$@

source: There are no .proto files under %@.
de: Unter %@ gibt es keine .proto-Dateien.

source: Timestamp is outside 0001-01-01 to 9999-12-31
de: Timestamp liegt außerhalb von 0001-01-01 bis 9999-12-31

source: a Value number cannot be NaN or infinite
de: eine Value-Zahl kann nicht NaN oder unendlich sein

source: a field claims %llu bytes, more than the data holds
de: ein Feld beansprucht %llu Bytes, mehr als die Daten enthalten

source: a field has an invalid field number
de: ein Feld hat eine ungültige Feldnummer

source: a field uses the unknown wire type %lld
de: ein Feld verwendet den unbekannten Wire-Typ %lld

source: a group ends without having started
de: eine Gruppe endet, ohne begonnen zu haben

source: a text field is not valid UTF-8
de: ein Textfeld ist kein gültiges UTF-8

source: an integer is encoded with more than 10 bytes
de: eine Ganzzahl ist mit mehr als 10 Bytes kodiert

source: control character in string
de: Steuerzeichen im String

source: elements carry fields this schema does not know, and this edit both changes elements and adds or removes others, so they cannot be matched up. Save those two kinds of change separately.
de: Elemente enthalten Felder, die dieses Schema nicht kennt, und diese Änderung ändert Elemente und fügt zugleich andere hinzu oder entfernt sie, sodass sie sich nicht zuordnen lassen. Sichere diese beiden Arten von Änderungen getrennt.

source: elements that look the same carry different fields this schema does not know, so it cannot tell which one was removed.
de: gleich aussehende Elemente enthalten unterschiedliche Felder, die dieses Schema nicht kennt, daher lässt sich nicht feststellen, welches entfernt wurde.

source: expected %@
de: %@ erwartet

source: expected ',' or ']'
de: ',' oder ']' erwartet

source: expected ',' or '}'
de: ',' oder '}' erwartet

source: expected ':'
de: ':' erwartet

source: expected a base64 string
de: Base64-String erwartet

source: expected a number
de: Zahl erwartet

source: expected a quoted key
de: Schlüssel in Anführungszeichen erwartet

source: expected a string
de: String erwartet

source: expected a string for %@
de: String für %@ erwartet

source: expected an array
de: Array erwartet

source: expected an array for ListValue
de: Array für ListValue erwartet

source: expected an integer
de: Ganzzahl erwartet

source: expected an object for %@
de: Objekt für %@ erwartet

source: expected an object for Any
de: Objekt für Any erwartet

source: expected an object for Struct
de: Objekt für Struct erwartet

source: expected an object for a map
de: Objekt für eine Map erwartet

source: expected an unsigned integer
de: vorzeichenlose Ganzzahl erwartet

source: expected true or false
de: true oder false erwartet

source: field is set more than once
de: Feld ist mehrfach gesetzt

source: field mask path %@ has no JSON form
de: Feldmaskenpfad %@ hat keine JSON-Form

source: field mask path %@ must be lowerCamelCase
de: Feldmaskenpfad %@ muss lowerCamelCase sein

source: google.protobuf.ListValue in this schema has no field 1
de: google.protobuf.ListValue hat in diesem Schema kein Feld 1

source: group fields are kept as raw bytes and cannot be edited
de: Gruppenfelder bleiben rohe Bytes und können nicht bearbeitet werden

source: invalid UTF-8 in string
de: ungültiges UTF-8 im String

source: invalid \u escape
de: ungültige \u-Escape-Sequenz

source: invalid escape
de: ungültige Escape-Sequenz

source: invalid number
de: ungültige Zahl

source: map key must be true or false
de: Map-Schlüssel muss true oder false sein

source: messages are nested too deeply
de: Nachrichten sind zu tief verschachtelt

source: nesting is too deep
de: Verschachtelung ist zu tief

# only one of oneof %@ may be set, %@ already is
source: only one of oneof %1$@ may be set, %2$@ already is
de: nur ein Feld von oneof %1$@ darf gesetzt sein, %2$@ ist es bereits

source: protoc could not be started: %@
de: protoc konnte nicht gestartet werden: %@

source: required field is missing
de: Pflichtfeld fehlt

source: the data ends in the middle of a field
de: die Daten enden mitten in einem Feld

source: the data uses the deprecated group encoding
de: die Daten verwenden die veraltete Gruppenkodierung

source: the edited value could not be read back: %@
de: der bearbeitete Wert konnte nicht zurückgelesen werden: %@

source: type %@ is not in the schema
de: Typ %@ ist nicht im Schema

source: unexpected character
de: unerwartetes Zeichen

source: unexpected content after the value
de: unerwarteter Inhalt nach dem Wert

source: unexpected end of input
de: unerwartetes Ende der Eingabe

source: unknown field in %@
de: unbekanntes Feld in %@

source: unpaired surrogate
de: ungepaartes Surrogat

source: unterminated escape
de: unvollständige Escape-Sequenz

source: unterminated string
de: nicht abgeschlossener String
